app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R') ORDER BY release_date asc
SELECT "movies".* FROM "movies" ORDER BY release_date asc
---
  def index

    if params.has_key? 'ratings'
      @movies = Movie.find_all_by_rating(params[:ratings])
    else
      @movies = Movie.order(params[:sort_param]) # orders the movies by the current parameter